In [3]:
import pandas as pd

In [5]:
df = pd.read_csv("student_dataset.csv")
print(df)

   StudentID     Name  Math  Science  English  History Grade
0        101    Alice    88       92       85       90     A
1        102      Bob    76       81       79       74     B
2        103  Charlie    65       70       72       68     C
3        104    Diana    90       95       93       97     A
4        105    Ethan    82       78       80       85     B
5        106    Fiona    55       60       58       62     D
6        107   George    71       75       73       70     C
7        108   Hannah    94       98       96       92     A
8        109      Ian    68       65       70       72     C
9        110    Jenny    84       88       86       83     B

In [9]:
print("First 5 rows:\n",df.head())
print("last 5 rows:\n",df.tail())

print("Display the info of dataset")
print(df.info())

First 5 rows:
    StudentID     Name  Math  Science  English  History Grade
0        101    Alice    88       92       85       90     A
1        102      Bob    76       81       79       74     B
2        103  Charlie    65       70       72       68     C
3        104    Diana    90       95       93       97     A
4        105    Ethan    82       78       80       85     B
last 5 rows:
    StudentID    Name  Math  Science  English  History Grade
5        106   Fiona    55       60       58       62     D
6        107  George    71       75       73       70     C
7        108  Hannah    94       98       96       92     A
8        109     Ian    68       65       70       72     C
9        110   Jenny    84       88       86       83     B
Display the info of dataset
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   StudentID  10 non-null     int64
 1   Name       10 non-null     object
 2   Math       10 non-null     int64
 3   Science    10 non-null     int64
 4   English    10 non-null     int64
 5   History    10 non-null     int64
 6   Grade      10 non-null     object
dtypes: int64(5), object(2)
memory usage: 692.0+ bytes
None

In [15]:
#descibe
print("Describe the complete dataset")
print(df.describe())


#shape
print("\nShape is -",df.shape)

#column
print("\nColumns is -",df.columns)

Describe the complete dataset
       StudentID       Math    Science    English    History
count   10.00000  10.000000  10.000000  10.000000  10.000000
mean   105.50000  77.300000  80.200000  79.200000  79.300000
std      3.02765  12.463725  12.959767  11.438726  11.690927
min    101.00000  55.000000  60.000000  58.000000  62.000000
25%    103.25000  68.750000  71.250000  72.250000  70.500000
50%    105.50000  79.000000  79.500000  79.500000  78.500000
75%    107.75000  87.000000  91.000000  85.750000  88.750000
max    110.00000  94.000000  98.000000  96.000000  97.000000

Shape is - (10, 7)

Columns is - Index(['StudentID', 'Name', 'Math', 'Science', 'English', 'History', 'Grade'], dtype='object')

In [18]:
# access
print("\n\nStudentID (single column returns series)")
print(df['StudentID'])

#multiple access
print(df[['StudentID','Math','Science']])

StudentID (single column returns series)
0    101
1    102
2    103
3    104
4    105
5    106
6    107
7    108
8    109
9    110
Name: StudentID, dtype: int64
   StudentID  Math  Science
0        101    88       92
1        102    76       81
2        103    65       70
3        104    90       95
4        105    82       78
5        106    55       60
6        107    71       75
7        108    94       98
8        109    68       65
9        110    84       88

In [30]:
# filter rows
filtered_row = df[df['Math'] < 70]
print(filtered_row)

#filter row with multiple condition
filtered_row = df[(df['Math'] >= 70) & (df['Math'] <= 90)]
print(filtered_row)

filtered_row2 = df[(df['Science'] > 60) & (df['Science'] % 2 == 0)]
print(filtered_row2)

   StudentID     Name  Math  Science  English  History Grade
2        103  Charlie    65       70       72       68     C
5        106    Fiona    55       60       58       62     D
8        109      Ian    68       65       70       72     C
   StudentID    Name  Math  Science  English  History Grade
0        101   Alice    88       92       85       90     A
1        102     Bob    76       81       79       74     B
3        104   Diana    90       95       93       97     A
4        105   Ethan    82       78       80       85     B
6        107  George    71       75       73       70     C
9        110   Jenny    84       88       86       83     B
   StudentID     Name  Math  Science  English  History Grade
0        101    Alice    88       92       85       90     A
2        103  Charlie    65       70       72       68     C
4        105    Ethan    82       78       80       85     B
7        108   Hannah    94       98       96       92     A
9        110    Jenny    84       88       86       83     B

In [ ]:
#adding new column
df['Computer'] = df['Math'] // 2 
print(df)

df['Hindi'] = [80,56,96,75,48,53,62,43,85,81]
print(df)

   StudentID     Name  Math  Science  English  History Grade  Computer
0        101    Alice    88       92       85       90     A        44
1        102      Bob    76       81       79       74     B        38
2        103  Charlie    65       70       72       68     C        32
3        104    Diana    90       95       93       97     A        45
4        105    Ethan    82       78       80       85     B        41
5        106    Fiona    55       60       58       62     D        27
6        107   George    71       75       73       70     C        35
7        108   Hannah    94       98       96       92     A        47
8        109      Ian    68       65       70       72     C        34
9        110    Jenny    84       88       86       83     B        42
   StudentID     Name  Math  Science  English  History Grade  Computer  Hindi
0        101    Alice    88       92       85       90     A        44     80
1        102      Bob    76       81       79       74     B        38     56
2        103  Charlie    65       70       72       68     C        32     96
3        104    Diana    90       95       93       97     A        45     75
4        105    Ethan    82       78       80       85     B        41     48
5        106    Fiona    55       60       58       62     D        27     53
6        107   George    71       75       73       70     C        35     62
7        108   Hannah    94       98       96       92     A        47     43
8        109      Ian    68       65       70       72     C        34     85
9        110    Jenny    84       88       86       83     B        42     81

In [58]:
# adding using insert method
df.insert(3,"Ar",[90,60,70,80,45,78,80,85,82,71])
print(df)

   StudentID     Name  Math  Ar  Art  Science  English  History Grade
0        101    Alice  44.0  90   90       92       85       90     A
1        102      Bob  38.0  60   60       81       79       74     B
2        103  Charlie  32.5  70   70       70       72       68     C
3        104    Diana  45.0  80   80       95       93       97     A
4        105    Ethan  41.0  45   45       78       80       85     B
5        106    Fiona  27.5  78   78       60       58       62     D
6        107   George  35.5  80   80       75       73       70     C
7        108   Hannah  47.0  85   85       98       96       92     A
8        109      Ian  34.0  82   82       65       70       72     C
9        110    Jenny  42.0  71   71       88       86       83     B

In [50]:
#updating using loc
df.loc[2,'Math'] = 96
print(df['Math'])

0    44.0
1    38.0
2    96.0
3    45.0
4    41.0
5    27.5
6    35.5
7    47.0
8    34.0
9    42.0
Name: Math, dtype: float64

In [52]:
#decresing number by 50%
df = pd.read_csv("student_dataset.csv")
df['Math'] = df['Math'] * 0.5
print(df)

   StudentID     Name  Math  Science  English  History Grade
0        101    Alice  44.0       92       85       90     A
1        102      Bob  38.0       81       79       74     B
2        103  Charlie  32.5       70       72       68     C
3        104    Diana  45.0       95       93       97     A
4        105    Ethan  41.0       78       80       85     B
5        106    Fiona  27.5       60       58       62     D
6        107   George  35.5       75       73       70     C
7        108   Hannah  47.0       98       96       92     A
8        109      Ian  34.0       65       70       72     C
9        110    Jenny  42.0       88       86       83     B

In [64]:
#reoving column
# df.drop(columns=["Art"], inplace=True)
# df.drop(columns=["Ar"], inplace=True)
# print(df)


#remove multiple column
df.drop(columns=["History","Math"], inplace=True)
print(df)

   StudentID     Name  Science  English Grade
0        101    Alice       92       85     A
1        102      Bob       81       79     B
2        103  Charlie       70       72     C
3        104    Diana       95       93     A
4        105    Ethan       78       80     B
5        106    Fiona       60       58     D
6        107   George       75       73     C
7        108   Hannah       98       96     A
8        109      Ian       65       70     C
9        110    Jenny       88       86     B

In [69]:
data = {
    "Name":["Ram",None,"Ghanshym","Dhanshyam","Aditya","Jagdish","Raj","Simran"],
    "Age":[28,None,22,30,29,40,25,32],
    "Salary":[50000,None,45000,52000,49000,70000,48000,58000],
    "Performance_Score":[85,None,78,92,88,95,80,89]
}

df = pd.DataFrame(data)
# print(df)

print(df.isnull())
print(df.isnull().sum()) #return the total number none value in a column

    Name    Age  Salary  Performance_Score
0  False  False   False              False
1   True   True    True               True
2  False  False   False              False
3  False  False   False              False
4  False  False   False              False
5  False  False   False              False
6  False  False   False              False
7  False  False   False              False
Name                 1
Age                  1
Salary               1
Performance_Score    1
dtype: int64

In [73]:
#dropna() - remove missing value

data = {
    "Name":["Ram",None,"Ghanshym","Dhanshyam","Aditya","Jagdish","Raj","Simran"],
    "Age":[28,None,22,30,29,40,25,32],
    "Salary":[50000,None,45000,52000,49000,70000,48000,58000],
    "Performance_Score":[85,None,78,92,88,95,80,89]
}

df = pd.DataFrame(data)
print(df)

df.dropna(inplace=True)
print(df)

        Name   Age   Salary  Performance_Score
0        Ram  28.0  50000.0               85.0
1       None   NaN      NaN                NaN
2   Ghanshym  22.0  45000.0               78.0
3  Dhanshyam  30.0  52000.0               92.0
4     Aditya  29.0  49000.0               88.0
5    Jagdish  40.0  70000.0               95.0
6        Raj  25.0  48000.0               80.0
7     Simran  32.0  58000.0               89.0
        Name   Age   Salary  Performance_Score
0        Ram  28.0  50000.0               85.0
2   Ghanshym  22.0  45000.0               78.0
3  Dhanshyam  30.0  52000.0               92.0
4     Aditya  29.0  49000.0               88.0
5    Jagdish  40.0  70000.0               95.0
6        Raj  25.0  48000.0               80.0
7     Simran  32.0  58000.0               89.0

In [80]:
#fillna() - fill missing values

data = {
    "Name":["Ram",None,"Ghanshym","Dhanshyam","Aditya","Jagdish","Raj","Simran"],
    "Age":[28,None,22,30,29,40,25,32],
    "Salary":[50000,None,45000,52000,49000,70000,48000,58000],
    "Performance_Score":[85,None,78,92,88,95,80,89]
}

df = pd.DataFrame(data)
print(df)

df['Age'].fillna(df['Age'].mean(), inplace=True)
df['Salary'].fillna(df['Salary'].mean(), inplace=True)
df['Performance_Score'].fillna(df['Performance_Score'].mean(), inplace=True)
print(df)

        Name   Age   Salary  Performance_Score
0        Ram  28.0  50000.0               85.0
1       None   NaN      NaN                NaN
2   Ghanshym  22.0  45000.0               78.0
3  Dhanshyam  30.0  52000.0               92.0
4     Aditya  29.0  49000.0               88.0
5    Jagdish  40.0  70000.0               95.0
6        Raj  25.0  48000.0               80.0
7     Simran  32.0  58000.0               89.0
        Name        Age        Salary  Performance_Score
0        Ram  28.000000  50000.000000          85.000000
1       None  29.428571  53142.857143          86.714286
2   Ghanshym  22.000000  45000.000000          78.000000
3  Dhanshyam  30.000000  52000.000000          92.000000
4     Aditya  29.000000  49000.000000          88.000000
5    Jagdish  40.000000  70000.000000          95.000000
6        Raj  25.000000  48000.000000          80.000000
7     Simran  32.000000  58000.000000          89.000000

C:\Users\dell\AppData\Local\Temp\ipykernel_11908\1036041257.py:13: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df['Age'].mean(), inplace=True)
C:\Users\dell\AppData\Local\Temp\ipykernel_11908\1036041257.py:14: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Salary'].fillna(df['Salary'].mean(), inplace=True)
C:\Users\dell\AppData\Local\Temp\ipykernel_11908\1036041257.py:15: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Performance_Score'].fillna(df['Performance_Score'].mean(), inplace=True)

In [85]:
#interpolation  

data = {
    "Name":["Ram","Shayam","Ghanshym","Dhanshyam","Aditya","Jagdish","Raj","Simran"],
    "Age":[28,None,22,30,29,40,25,32],
    "Salary":[50000,None,45000,52000,49000,70000,48000,58000],
    "Performance_Score":[85,None,78,92,88,95,80,89]
}

df = pd.DataFrame(data)
print(df)

df = df.interpolate(method='linear',axis=0)
print(df)

        Name   Age   Salary  Performance_Score
0        Ram  28.0  50000.0               85.0
1     Shayam   NaN      NaN                NaN
2   Ghanshym  22.0  45000.0               78.0
3  Dhanshyam  30.0  52000.0               92.0
4     Aditya  29.0  49000.0               88.0
5    Jagdish  40.0  70000.0               95.0
6        Raj  25.0  48000.0               80.0
7     Simran  32.0  58000.0               89.0
        Name   Age   Salary  Performance_Score
0        Ram  28.0  50000.0               85.0
1     Shayam  25.0  47500.0               81.5
2   Ghanshym  22.0  45000.0               78.0
3  Dhanshyam  30.0  52000.0               92.0
4     Aditya  29.0  49000.0               88.0
5    Jagdish  40.0  70000.0               95.0
6        Raj  25.0  48000.0               80.0
7     Simran  32.0  58000.0               89.0

C:\Users\dell\AppData\Local\Temp\ipykernel_11908\1630781193.py:13: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df = df.interpolate(method='linear',axis=0)

In [87]:
#linear dataframe

data1 = {
    "Time":[1,2,3,4,5],
    "value":[10,None,30,None,50]
}

df = pd.DataFrame(data1)
print("Before interpolation")
print(df)

print("\n\nAfter interpolation")

df["value"] = df["value"].interpolate(method="linear")
print(df)

Before interpolation
   Time  value
0     1   10.0
1     2    NaN
2     3   30.0
3     4    NaN
4     5   50.0


After interpolation
   Time  value
0     1   10.0
1     2   20.0
2     3   30.0
3     4   40.0
4     5   50.0

In [91]:
#sorting 
#sorting data 1 column sort_values()

df = pd.read_csv("student_dataset.csv")
df.sort_values(by="Math", ascending=True, inplace=True)
print(df)

#sorting data multiple column
df.sort_values(by=["Math","Science"], ascending=False, inplace=True)
print(df)

   StudentID     Name  Math  Science  English  History Grade
5        106    Fiona    55       60       58       62     D
2        103  Charlie    65       70       72       68     C
8        109      Ian    68       65       70       72     C
6        107   George    71       75       73       70     C
1        102      Bob    76       81       79       74     B
4        105    Ethan    82       78       80       85     B
9        110    Jenny    84       88       86       83     B
0        101    Alice    88       92       85       90     A
3        104    Diana    90       95       93       97     A
7        108   Hannah    94       98       96       92     A
   StudentID     Name  Math  Science  English  History Grade
7        108   Hannah    94       98       96       92     A
3        104    Diana    90       95       93       97     A
0        101    Alice    88       92       85       90     A
9        110    Jenny    84       88       86       83     B
4        105    Ethan    82       78       80       85     B
1        102      Bob    76       81       79       74     B
6        107   George    71       75       73       70     C
8        109      Ian    68       65       70       72     C
2        103  Charlie    65       70       72       68     C
5        106    Fiona    55       60       58       62     D

In [ ]:
#aggregation function

data2 = {
    "Name": ["Arun","Varun","Karan"],
    "Age": [28,34,22],
    "Salary": [10000,20000,30000]
}
df = pd.DataFrame(data2)

means = df["Age"].mean()
print(means)
means = df["Age"].sum()
print(means)

28.0
84

In [ ]:
#grouping

data2 = {
    "Name": ["Arun","Varun","Karan","Narun","Marun"],
    "Age": [28,34,22,34,28],
    "Salary": [50000,60000,45000,52000,48000]
}
df = pd.DataFrame(data2)

grouped = df.groupby("Age")["Salary"].sum()
print(grouped)

Age
22     45000
28     98000
34    112000
Name: Salary, dtype: int64

In [101]:
#multiple column group then apply aggregation function
grouped = df.groupby("Age").agg({"Salary":"sum","Name":"count"})
print(grouped)

     Salary  Name
Age
22    45000     1
28    98000     2
34   112000     2

In [103]:
#merging 
#syntax = pd.merge(df1,df2, on="column name",how="type of join")

data1 = {
    "EmployeeID":[1,2,3,4],
    "Name":["Ram","Shyam","Ghanshym","Dhanshyam"]
}
df1 = pd.DataFrame(data1)
data2 = {
    "EmployeeID":[3,4,5,6],
    "Department":["IT","HR","Finance","Admin"]
}
df2 = pd.DataFrame(data2)

merge_inner = pd.merge(df1,df2, on="EmployeeID", how="inner")
print(merge_inner)

merge_left = pd.merge(df1,df2, on="EmployeeID", how="left")
print(merge_left)

merge_right = pd.merge(df1,df2, on="EmployeeID", how="right")
print(merge_right)

merge_outer = pd.merge(df1,df2, on="EmployeeID", how="outer")
print(merge_outer)

   EmployeeID       Name Department
0           3   Ghanshym         IT
1           4  Dhanshyam         HR
   EmployeeID       Name Department
0           1        Ram        NaN
1           2      Shyam        NaN
2           3   Ghanshym         IT
3           4  Dhanshyam         HR
   EmployeeID       Name Department
0           3   Ghanshym         IT
1           4  Dhanshyam         HR
2           5        NaN    Finance
3           6        NaN      Admin
   EmployeeID       Name Department
0           1        Ram        NaN
1           2      Shyam        NaN
2           3   Ghanshym         IT
3           4  Dhanshyam         HR
4           5        NaN    Finance
5           6        NaN      Admin

In [105]:
#concatenate
'''vertically (row - wise)
horizontally ( column wise)
pd.concate([df1, df2, axis=0], ignore_index=True)
'''

data1 = {
    "EmployeeID":[1,2,3,4],
    "Name":["Ram","Shyam","Ghanshym","Dhanshyam"]
}
df1 = pd.DataFrame(data1)
data2 = {
    "EmployeeID":[5,6,7,8],
    "Name":["Arun","Varun","Karan","Naran"]
}
df2 = pd.DataFrame(data2)

concat_row = pd.concat([df1,df2], axis=0, ignore_index=True)
print(concat_row)

concat_column = pd.concat([df1,df2], axis=1)
print(concat_column)

   EmployeeID       Name
0           1        Ram
1           2      Shyam
2           3   Ghanshym
3           4  Dhanshyam
4           5       Arun
5           6      Varun
6           7      Karan
7           8      Naran
   EmployeeID       Name  EmployeeID   Name
0           1        Ram           5   Arun
1           2      Shyam           6  Varun
2           3   Ghanshym           7  Karan
3           4  Dhanshyam           8  Naran